newsFeed/app/controllers/api/feeds_controller.rb

SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = $1  [["feed_id", 1]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    render :json => Feed.find(params[:id]), include: :latest_entries

INSERT INTO "feeds" ("created_at", "title", "updated_at", "url") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Thu, 04 Jun 2015 22:06:46 UTC +00:00], ["title", "Quartz"], ["updated_at", Thu, 04 Jun 2015 22:06:46 UTC +00:00], ["url", "http://blog.qz.com/rss"]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."url" = 'http://blog.qz.com/rss' LIMIT 1
INSERT INTO "subscriptions" ("created_at", "feed_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 05 Jun 2015 00:25:15 UTC +00:00], ["feed_id", 8], ["updated_at", Fri, 05 Jun 2015 00:25:15 UTC +00:00], ["user_id", 1]]
---
  def create
    feed = Feed.find_or_create_by_url(feed_params[:url])
    if feed
      Subscription.create!(user_id: current_user.id, feed_id: feed.id);

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "4"]]
DELETE FROM "feeds" WHERE "feeds"."id" = $1  [["id", 4]]
---
  def destroy
    feed = Feed.find(params[:id])
    feed.destroy